WriterTyper/app/controllers/texts_controller.rb

  def index
    @author = Author.find(params[:author_id])
    @texts = Text.where(author_id: @author.id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "texts".* FROM "texts" WHERE "texts"."author_id" = $1  [["author_id", 1]]

  def update
    if @text.update(text_params)
---
UPDATE "texts" SET "words" = $1, "content" = $2 WHERE "texts"."id" = $3

  def destroy
    @text.destroy
---
DELETE FROM "texts" WHERE "texts"."id" = $1  [["id", 11]]

    def set_text
      @text = Text.find(params[:id])
---
SELECT "texts".* FROM "texts" WHERE "texts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]